# Test of Sparkify song play logs: Data Warehouse

## Connect SQL to the database

In [1]:
import configparser

In [2]:
%load_ext sql

In [3]:
config = configparser.ConfigParser()
config.read('dwh.cfg')

['dwh.cfg']

In [4]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(config['CLUSTER']['DB_USER'],config['CLUSTER']['DB_PASSWORD'],config['CLUSTER']['HOST'], config['CLUSTER']['DB_PORT'],config['CLUSTER']['DB_NAME'])
print(conn_string)
%sql $conn_string

postgresql://admindwh:Passw0rd@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public

## Check data filling in analytic tables

In [5]:
%sql SELECT * FROM staging_events LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
0 rows affected.

[]

In [6]:
%sql SELECT count(1) FROM staging_events LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [7]:
%sql SELECT * FROM staging_songs LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
0 rows affected.

[]

In [8]:
%sql SELECT count(1) FROM staging_songs LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [9]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[('3840562e743a5ff0bb1aa6ef5424dccc', datetime.datetime(2018, 11, 1, 21, 55, 25), 26, 'free', None, None, 169, 'San Jose-Sunnyvale-Santa Clara, CA', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('de2a658bf8c2e75340ea644b6d6d0ddf', datetime.datetime(2018, 11, 2, 5, 15, 41), 17, 'free', None, 'ARRH63Y1187FB47783', 118, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('787f39403298da112b21f84453c9d802', datetime.datetime(2018, 11, 2, 9, 4, 16), 15, 'paid', None, None, 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('77ae5aafcff9bfdcd2bfcb2f38535cbc', datetime.datetime(2018, 11, 2, 11, 20, 37), 15, 'paid', None, None, 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('c6bc1aed7bc77d5029f15ede52dd7e9d', datetime.datetime(2018, 11, 2, 11, 23, 28), 44, 'paid', None, 'AREJ4S91187B9AD10C', 157, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0')]

In [10]:
%sql SELECT count(1) FROM songplays;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(6849,)]

In [11]:
%sql SELECT * FROM songplays WHERE artist_id is not null  LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[('d2ecd4f950f2d064e84a57e38f625c6f', datetime.datetime(2018, 11, 1, 21, 5, 52), 8, 'free', None, 'AR3HS9C1187FB48878', 139, 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 ('d832d29a1584893829ac4b164e1e955b', datetime.datetime(2018, 11, 2, 10, 4, 5), 15, 'paid', None, 'ARRBMZQ1187B98E98D', 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('d8e00bec20009067504ae04ce0dcb6b5', datetime.datetime(2018, 11, 2, 10, 21, 25), 15, 'paid', None, 'AR3X6YL1187B9A44A0', 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('f74fddfdd47b68867d9124096bbd8559', datetime.datetime(2018, 11, 2, 10, 33, 11), 15, 'paid', None, 'AR3U6A11187B9B5D36', 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 ('faebb6cd49ac3dfeb771117ac16cba34', datetime.datetime(2018, 11, 2, 10, 59, 19), 15, 'paid', None, 'ARGSXDC1187FB3EFC4', 172, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [12]:
%sql SELECT count(1) FROM songplays  WHERE artist_id is not null OR  song_id is not null;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(4287,)]

In [13]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[(7, 'Adelyn', 'Jordan', 'F', 'free'),
 (18, 'Jacob', 'Rogers', 'M', 'free'),
 (25, 'Jayden', 'Graves', 'M', 'paid'),
 (56, 'Cienna', 'Freeman', 'F', 'free'),
 (68, 'Jordan', 'Rodriguez', 'F', 'free')]

In [14]:
%sql SELECT count(1) FROM users;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(96,)]

In [15]:
%%sql
SELECT count(1) FROM (
SELECT user_id
FROM users
GROUP BY user_id
HAVING count(1)>1) a

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [16]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[('SOAACTC12AB0186A20', 'Christmas Is Coming Soon', 'ARXWFZ21187FB43A0B', 2008, Decimal('180')),
 ('SOAADJH12AB018BD30', 'Black Light (Album Version)', 'AR3FKJ61187B990357', 1975, Decimal('385')),
 ('SOAAFUV12AB018831D', 'Where Do The Children Play? (LP Version)', 'AR5ZGC11187FB417A3', 0, Decimal('216')),
 ('SOAASHY12A58A7C439', 'Ricordo', 'AR0VQ8W1187FB4F4D9', 2003, Decimal('275')),
 ('SOABBVH12AF72A5B57', 'My Love I Love', 'ARUIM291187FB3911A', 2007, Decimal('132'))]

In [17]:
%sql SELECT count(1) FROM songs;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(14896,)]

In [18]:
%%sql
SELECT count(1) FROM (
SELECT song_id
FROM songs
GROUP BY song_id
HAVING count(1)>1) a

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [19]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[('AR00MQ31187B9ACD8F', 'Chris Carrier', '', None, None),
 ('AR039B11187B9B30D0', 'John Williams', 'NEW YORK, New York', None, None),
 ('AR048JZ1187B9AEB85', 'Yellowcard', 'Jacksonville, FL', Decimal('30'), Decimal('-81')),
 ('AR04S8J1187FB48358', 'Clifford Brown', 'Wilmington, DE', Decimal('39'), Decimal('-75')),
 ('AR050VJ1187B9B13A7', 'Dead Kennedys', '', None, None)]

In [20]:
%sql SELECT count(1) FROM artists;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(9553,)]

In [21]:
%%sql
SELECT count(1) FROM (
SELECT artist_id
FROM artists
GROUP BY artist_id
HAVING count(1)>1) a

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [22]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
5 rows affected.

[(datetime.datetime(2018, 11, 1, 21, 42), 21, 1, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 1, 25, 34), 1, 2, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 2, 3, 34, 34), 3, 2, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 2, 9, 1, 21), 9, 2, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 2, 10, 33, 11), 10, 2, 44, 11, 2018, 6)]

In [23]:
%%sql
SELECT count(1) FROM (
SELECT start_time
FROM time
GROUP BY start_time
HAVING count(1)>1) a

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(0,)]

In [24]:
%sql SELECT count(1) FROM time;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(6813,)]

In [26]:
%%sql 
SELECT trunc(start_time), count(1) 
FROM songplays
GROUP BY trunc(start_time)
ORDER BY trunc(start_time)
LIMIT 30
;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
30 rows affected.

[(datetime.date(2018, 11, 1), 12),
 (datetime.date(2018, 11, 2), 156),
 (datetime.date(2018, 11, 3), 100),
 (datetime.date(2018, 11, 4), 146),
 (datetime.date(2018, 11, 5), 359),
 (datetime.date(2018, 11, 6), 154),
 (datetime.date(2018, 11, 7), 174),
 (datetime.date(2018, 11, 8), 161),
 (datetime.date(2018, 11, 9), 253),
 (datetime.date(2018, 11, 10), 89),
 (datetime.date(2018, 11, 11), 74),
 (datetime.date(2018, 11, 12), 166),
 (datetime.date(2018, 11, 13), 340),
 (datetime.date(2018, 11, 14), 393),
 (datetime.date(2018, 11, 15), 481),
 (datetime.date(2018, 11, 16), 320),
 (datetime.date(2018, 11, 17), 127),
 (datetime.date(2018, 11, 18), 138),
 (datetime.date(2018, 11, 19), 279),
 (datetime.date(2018, 11, 20), 324),
 (datetime.date(2018, 11, 21), 438),
 (datetime.date(2018, 11, 22), 83),
 (datetime.date(2018, 11, 23), 240),
 (datetime.date(2018, 11, 24), 314),
 (datetime.date(2018, 11, 25), 42),
 (datetime.date(2018, 11, 26), 216),
 (datetime.date(2018, 11, 27), 257),
 (datetime.date(2018, 11, 28), 363),
 (datetime.date(2018, 11, 29), 319),
 (datetime.date(2018, 11, 30), 331)]

In [27]:
%%sql 
SELECT trunc(start_time), count(1) 
FROM time
GROUP BY trunc(start_time)
ORDER BY trunc(start_time)
LIMIT 30
;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
30 rows affected.

[(datetime.date(2018, 11, 1), 11),
 (datetime.date(2018, 11, 2), 155),
 (datetime.date(2018, 11, 3), 100),
 (datetime.date(2018, 11, 4), 144),
 (datetime.date(2018, 11, 5), 356),
 (datetime.date(2018, 11, 6), 154),
 (datetime.date(2018, 11, 7), 174),
 (datetime.date(2018, 11, 8), 161),
 (datetime.date(2018, 11, 9), 252),
 (datetime.date(2018, 11, 10), 87),
 (datetime.date(2018, 11, 11), 73),
 (datetime.date(2018, 11, 12), 166),
 (datetime.date(2018, 11, 13), 339),
 (datetime.date(2018, 11, 14), 389),
 (datetime.date(2018, 11, 15), 478),
 (datetime.date(2018, 11, 16), 319),
 (datetime.date(2018, 11, 17), 127),
 (datetime.date(2018, 11, 18), 138),
 (datetime.date(2018, 11, 19), 276),
 (datetime.date(2018, 11, 20), 322),
 (datetime.date(2018, 11, 21), 437),
 (datetime.date(2018, 11, 22), 82),
 (datetime.date(2018, 11, 23), 238),
 (datetime.date(2018, 11, 24), 313),
 (datetime.date(2018, 11, 25), 41),
 (datetime.date(2018, 11, 26), 216),
 (datetime.date(2018, 11, 27), 255),
 (datetime.date(2018, 11, 28), 361),
 (datetime.date(2018, 11, 29), 319),
 (datetime.date(2018, 11, 30), 330)]

## Check analysis queries

### Query 1: Find all the users that has paid account and listen more than 10 songs, who are they

In [29]:
%%sql
SELECT users.first_name, users.last_name
FROM songplays
JOIN users ON users.user_id = songplays.user_id 
WHERE songplays.level = 'paid'
GROUP BY users.first_name, users.last_name
HAVING count(1)>10
ORDER BY count(1) desc
;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
21 rows affected.

[('Chloe', 'Cuevas'),
 ('Tegan', 'Levine'),
 ('Kate', 'Harrell'),
 ('Lily', 'Koch'),
 ('Aleena', 'Kirby'),
 ('Jacqueline', 'Lynch'),
 ('Layla', 'Griffin'),
 ('Jacob', 'Klein'),
 ('Matthew', 'Jones'),
 ('Mohammad', 'Rodriguez'),
 ('Sara', 'Johnson'),
 ('Rylan', 'George'),
 ('Kinsley', 'Young'),
 ('Avery', 'Watkins'),
 ('Jayden', 'Graves'),
 ('Harper', 'Barrett'),
 ('Emily', 'Benson'),
 ('Avery', 'Martinez'),
 ('Hayden', 'Brock'),
 ('Jaleah', 'Hayes'),
 ('Amiya', 'Davidson')]

### Query 2:  Most popular artist among paid users

In [30]:
%%sql
SELECT artists.name as artist_name
FROM songplays
JOIN artists ON artists.artist_id = songplays.artist_id 
WHERE songplays.level = 'paid'
GROUP BY artists.name 
ORDER BY count(1) desc
LIMIT 1
;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[('Coldplay',)]

### Query 3: How much did User 2 listen songs

In [31]:
%%sql
SELECT songplays.user_id, count(1) as count_listening
FROM songplays
WHERE songplays.user_id = 2
GROUP BY songplays.user_id
;

 * postgresql://admindwh:***@dwhcluster.ckesytmadupu.us-west-2.redshift.amazonaws.com:5439/public
1 rows affected.

[(2, 10)]